app/ThirdParty/myth-auth/src/Controllers/AuthController.php

            $users = $users->withGroup($this->config->defaultUserGroup);
        }

        if (! $users->save($user)) {
---
INSERT INTO `users` (`password_hash`, `reset_hash`, `reset_at`, `reset_expires`, `email`, `username`, `active`, `activate_hash`, `created_at`, `updated_at`) VALUES ('$2y$10$BBSWh0FazjLSMuq7koiJmufuflKA4z.uUjOb3hXyRILfZSPQgpBqm', NULL, NULL, NULL, 'gabrielpanjaitan298@gmail.com', 'Gabrielpjt2503', 1, NULL, '2023-12-18 09:06:26', '2023-12-18 09:06:26')