app/Models/M_PenilaianPelanggan.php

SELECT *
FROM `penilaian_pelanggan`
SELECT *
FROM `penilaian_pelanggan`
WHERE `id` = '1'
 LIMIT 1
---
    public function getPenilaian($id = false)
    {
        if ($id == false) {
            return $this->findAll();
        } else {
            return $this->where(['id' => $id])->first();